---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaWeakAxis
source: html/cec689e9-36a0-3964-c200-85341da5a0d6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaWeakAxis Property

Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).

## Syntax (C#)
```csharp
public double ShearAreaWeakAxis { get; set; }
```